Revit 2026 API

# BuiltInFailuresSharedCoordinatesFailures Class

---

Failures about shared coordinates.

SystemObject Autodesk.Revit.DBBuiltInFailuresSharedCoordinatesFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class SharedCoordinatesFailures
```
```vb
Public NotInheritable Class SharedCoordinatesFailures
```
```cpp
public ref class SharedCoordinatesFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SharedCoordinatesFailures = class end
```

The BuiltInFailuresSharedCoordinatesFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotAcquireCoordinatesFromLinkWithScaledLocation | Can't acquire coordiantes from a link that has a scaled location. |
|  | CannotAcquireCoordinatesFromScaledLink | Can't acquire coordinates from a link that is scaled. |

#### Reference

Autodesk.Revit.DB Namespace